In [328]:
import psycopg2
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [187]:
def create_database():
    #connect to default database
    conn = psycopg2.connect("host=localhost dbname = postgres user=postgres password=27121994")
    conn.set_session(autocommit=True)
    cur = conn.cursor()
    
    #cretae a new database
    cur.execute("DROP DATABASE IF EXISTS accounts")
    cur.execute("CREATE DATABASE accounts")
    
    #close connection to default database
    conn.close()
    
    #connect to new database Account
    conn = psycopg2.connect("host=localhost dbname = accounts user=postgres password=27121994")
    cur = conn.cursor()
    
    return cur, conn

In [131]:
def drop_table(cur, conn):
    for query in drop_table_queries:
        cur.execute(query)
        conn.commit()

In [132]:
def create_table(cur, conn):
    for query in create_table_queries:
        cur.execute(query)
        conn.commit()

In [329]:
transaction = pd.read_csv("data/Transaction.csv")
kpmg = pd.read_excel("data/KPMG.xlsx",sheet_name=None)

In [134]:
for sheet in kpmg:
    print(sheet)

NewCustomerList
CustomerDemographic
CustomerAddress

In [241]:
address = kpmg.get("CustomerAddress")
address.columns

Index(['customer_id', 'address', 'postcode', 'state', 'country',
       'property_valuation'],
      dtype='object')

In [242]:
address.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [287]:
transaction.columns

Index(['transaction_id', 'product_id', 'customer_id', 'transaction_date',
       'online_order', 'order_status', 'brand', 'product_line',
       'product_class', 'product_size', 'list_price', 'standard_cost',
       'product_first_sold_date'],
      dtype='object')

In [330]:

transaction_clean = transaction[['transaction_id', 'product_id','customer_id', 'transaction_date', 'online_order','brand',
                                 'product_line','product_class', 'product_size','list_price','standard_cost']]
transaction_clean.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,brand,product_line,product_class,product_size,list_price,standard_cost
0,1,2,2950,25/02/2017,0.0,Solex,Standard,medium,medium,71.49,53.62
1,2,3,3120,21/05/2017,1.0,Trek Bicycles,Standard,medium,large,2091.47,388.92
2,3,37,402,16/10/2017,0.0,OHM Cycles,Standard,low,medium,1793.43,248.82
3,4,88,3135,31/08/2017,0.0,Norco Bicycles,Standard,medium,medium,1198.46,381.10
4,5,78,787,01/10/2017,1.0,Giant Bicycles,Standard,medium,large,1765.30,709.48

In [139]:
customer = kpmg.get("CustomerDemographic")
customer.columns

Index(['customer_id', 'first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'age', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'default', 'owns_car', 'tenure'],
      dtype='object')

In [140]:
customer_clean = customer[['customer_id', 'first_name', 'last_name', 'gender', 'past_3_years_bike_related_purchases', 'age',
                          'job_title', 'job_industry_category', 'wealth_segment', 'deceased_indicator', 'owns_car']]
customer_clean.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,age,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car
0,1,Laraine,Medendorp,F,93,69.0,Executive Secretary,Health,Mass Customer,N,Yes
1,2,Eli,Bockman,Male,81,42.0,Administrative Officer,Financial Services,Mass Customer,N,Yes
2,3,Arlin,Dearle,Male,61,69.0,Recruiting Manager,Property,Mass Customer,N,Yes
3,4,Talbot,NaN,Male,33,61.0,NaN,IT,Mass Customer,N,No
4,5,Sheila-kathryn,Calton,Female,56,45.0,Senior Editor,NaN,Affluent Customer,N,Yes

In [259]:
cur, conn = create_database()

In [260]:
customer_table_create = ("""CREATE TABLE IF NOT EXISTS customers(
customer_id INT PRIMARY KEY,
first_name VARCHAR,
last_name VARCHAR,
gender VARCHAR,
past3_years_bike_related_purchases INT,
age FLOAT,
job_title VARCHAR,
job_industry_category VARCHAR,
wealth_segment VARCHAR,
deceased_indicator VARCHAR,
owns_car VARCHAR
);""")

In [261]:
cur.execute(customer_table_create, vars=None)

In [ ]:
conn.commit()

In [340]:
transaction_table_create = ("""CREATE TABLE IF NOT EXISTS transaction(
transaction_id INT,
product_id INT,
customer_id INT,
transaction_date VARCHAR,
online_order INT,
brand VARCHAR,
product_line VARCHAR,
product_class VARCHAR,
product_size VARCHAR,
list_price FLOAT4,
standard_cost FLOAT4
);""")

In [341]:
cur.execute(transaction_table_create, vars=None)

In [ ]:
conn.commit()

In [264]:
address_table_create = ("""CREATE TABLE IF NOT EXISTS address(
customer_id INT,
address VARCHAR,
postcode INT,
state VARCHAR,
country VARCHAR,
property_valuation VARCHAR
);""")

In [265]:
cur.execute(address_table_create, vars=None)

In [ ]:
conn.commit()

In [281]:
insert_into_customers = ("""INSERT INTO  customers(
customer_id,
first_name,
last_name,
gender,
past3_years_bike_related_purchases,
age,
job_title,
job_industry_category,
wealth_segment,
deceased_indicator,
owns_car
)
VALUES(%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)""")

In [282]:
for i, row in customer_clean.iterrows():
    #print(list(row))
    cur.execute(insert_into_customers, list(row))

In [343]:
insert_into_transaction = ("""INSERT INTO transaction(
transaction_id,
product_id,
customer_id,
transaction_date,
online_order,
brand,
product_line,
product_class,
product_size,
list_price,
standard_cost
)
VALUES(%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)""")

In [344]:
for i, row in transaction_clean.iterrows():
    #print(list(row))
    cur.execute(insert_into_transaction, list(row))

NumericValueOutOfRange: integer out of range

In [342]:
conn.commit()

In [278]:
insert_into_address = ("""INSERT INTO address(
customer_id,
address,
postcode,
state,
country,
property_valuation
)
VALUES(%s,%s,%s,%s,%s,%s)""")

In [279]:
for i, row in address.iterrows():
    #print(list(row))
    cur.execute(insert_into_address, list(row))

In [339]:
conn.commit()

In [258]:
cur.close()
conn.close()

In [322]:
cur